app/Controllers/Home.php

    public function ceklogin()
    {
        //tangkap varabel yang dikirim dari form login username dan password
        $session = session();
        $username = $this->request->getVar('username'); // ambil data username di database
        $password = $this->request->getVar('password'); // Get password from input

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin1234'
 LIMIT 1

    public function inputUser(){
        $userModel = new UserModel();
        $data = [
            'username' => $this->request->getVar('username'),
            'email' => $this->request->getVar('email'),
            'password' => $this->hashPassword($this->request->getVar('password')),
            'full_name' => $this->request->getVar('full_name'),
            'role' => $this->request->getVar('role'),
            'profile_pic_url' => $this->request->getVar('profile_pic_url'),
            'date_birth' => $this->request->getVar('date_birth'),
            'gender' => $this->request->getVar('gender'),
            'phone' => $this->request->getVar('phone'),
            'address' => $this->request->getVar('address'),
            'created_at' => Time::now('Asia/Jakarta')->toDateTimeString(),
            'updated_at' => Time::now('Asia/Jakarta')->toDateTimeString()
        ];
        if ($userModel->insert($data)) {
---
INSERT INTO `user` (`username`, `email`, `password`, `full_name`, `role`, `profile_pic_url`, `date_birth`, `gender`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('Dwaker', 'dwaker@gmail.com', '$2y$10$aQEES7kHC1HDyZ57HMwWmuIZp6FNHkIwZY5W6WNwGrVYpWtP8RDT2', 'Dwakellist', 'Mentor', NULL, '2025-05-05', 'R1', '082361824342', 'Medan', '2025-05-05 14:48:09', '2025-05-05 14:48:09')